3000-READ-PARA
	READ INFILE AT END MOVE 'Y' TO WS-EOF
	IF WS-FS = '00'
	PERFORM 4000-DISPLAY-PARA
	END-IF

4000-DISPLAY-PARA.
	DISPLAY EMP-REC.
	IF DEPT = '1002'
		MOVE 'NEW DELHI' TO ELOC
		REWRITE EMP-REC
		IF WS-FS NOT = '00'
			DISPLAY 'ERROR WHILE REWRITTING'
		END-IF
	END-IF


5000-CLOSE PARA.
	CLOSE INFILE.

9000-EXIT-PARA.
	STOP RUN.