GIDENTIFICAION DIVISION.
PROGRAM-ID. SAMPLE.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
		SELECT EMPFILE ASSIGN TO  INDD
		ORGANIZATION IS SEQUENTIAL /INDEXEX/RELATIVE
		ACCESS MODE IS  SEQUENTIAL/RANDOM 
		FILE STATUS IS  EMP-FS. 

DATA-DIVISON.
FILE SECTION.
FD EMPFILE.
01 EMP-REC   PIC X(85)
	
	
	
-
WORKING-STORAGE SECTION.
01 EMP-FS     PIC XX.
01 WS-EOF     PIC X VALUE 'N'.
01 WS-EMPREC
	05 WS-EMPID    PIC X(05).
	05 WS ENAME    PIC X(20).
	05 WS-EDEPT    PIC X(5).
	05 WS-FILLER   PIC X(55).
	

PROCEDURE DIVISION.
1000-MAIN-PARA.
	OPEN INPUT/OUTPUT/I-O/EXTEND EMPFILE.	
	IF EMP-FS NOT = '00'
		<STATEMENTS>
	END-IF.
	
	
	PERFORM 2000-PROCESS-PARA UNTIL WS-EOF = 'Y'.
	CLOSE EMPFILE.
	STOP RUN.


2000-PROCESS-PARA.
	
	READ EMPFILE AT END MOVE 'Y' TO WS-EOF.  
	IF EMP-FS = '00'.
		DISPLAY EMP-REC
	END-IF.



runjcl


//TSOAVAR JOB 12345, TSOAVAR,MSGCLASS=X, CLASS=A, NOTIFY=&SYSUID,
//		MSGLEVEL =(1,1), USER=TSOAVAR
//S1      EXEC PGM=TRN19878
//STEPLIB DD DSN-ENDEVOUR.DEV1.LOAD,DISP=SHR
//SYSOUT  DD SYSOUT=*
//INFILE  DD DS=TSOAVAR.TRAINING.EMPFILE.		
