IDENTIFICATION DIVISION.                                        
      PROGRAM-ID. TRN1497D.                                           
      ENVIRONMENT DIVISION.                                           
      INPUT-OUTPUT SECTION.                                           
      FILE-CONTROL.                                                   
          SELECT FLATFILE ASSIGN TO INDD                              
          ORGANIZATION IS SEQUENTIAL                                  
          ACCESS MODE IS SEQUENTIAL                                   
          FILE STATUS IS WS-FS1.                                      
      DATA DIVISION.                                                  
      FILE SECTION.                                                   
      FD FLATFILE.                                                    
      01 EMP-REC.                                                     
          02 DEPTID PIC 9(06).                                        
          02 FILLER PIC X.                                            
          02 DEPTNAME PIC X(40).                                
          02 FILLER PIC X(33).                                  
      WORKING-STORAGE SECTION.                                  
      01 WS-COUNT PIC S9(4) COMP VALUE 0.                       
      01 WS-FS1   PIC XX.                                       
      01 WS-EOF PIC X VALUE 'N'.                                
      01 EDITING PIC -Z(9) .                                    
          EXEC SQL                                              
             INCLUDE SQLCA                                      
          END-EXEC.                                             
          EXEC SQL                                              
              INCLUDE TRNGDEPT                                  
          END-EXEC.                                             
      PROCEDURE DIVISION.                                       
      1000-MAIN-PARA.                                           
           OPEN INPUT FLATFILE.                                 
            PERFORM 2000-INSERT-PARA UNTIL WS-EOF='Y'.            
            CLOSE FLATFILE.                                       
            PERFORM 2000-STOP-PARA.                               
       2000-INSERT-PARA.                                          
            READ FLATFILE AT END MOVE 'Y' TO WS-EOF.              
            ADD 1 TO WS-COUNT.                                    
            IF WS-EOF NOT= 'Y' THEN                               
            MOVE DEPTID TO DEP-DEPT-NUMBER                        
            MOVE DEPTNAME TO DEP-DEPT-NAME                        
            EXEC SQL                                              
                 INSERT INTO DEPT_TABLE                           
                 VALUES(:DEP-DEPT-NUMBER,:DEP-DEPT-NAME)          
            END-EXEC                                              
            EVALUATE SQLCODE                                      
            WHEN 0                                                
            DISPLAY 'RECORD INSERTED'                             
           WHEN OTHER                                              
           MOVE SQLCODE TO EDITING                                 
           DISPLAY 'RECORD NOT INSERTED', EDITING                  
           END-EVALUATE                                            
           END-IF.                                                 
                                                                   
           IF WS-COUNT = 15                                        
              MOVE 'Y' TO WS-EOF                                   
           END-IF.                                                 
                                                                   
      2000-STOP-PARA.                                              
           STOP RUN.                                               
