IDENTIFICATION DIVISION.
PROGRAM-ID. TRN1698R
*
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE CONTROL.
	SELECT INFILE ASSIGN TO INDD
	ORGANIZATION IS INDEXED
	ACCESS MODE IS RANDOM/SEQUENTIAL/DYNAMIC
	RECORD KEY IS EID
	ALTERNATE RECORD KEY IS ENAME WITH DUPLICATES
	FILE STATUS IS WS-FS

*

DATA DIVISION.
FILE SECTION.
FD INFILE.
01 EMP-REC.
	05  EID 	PIC X(05).
	05  FILLER	PIC X.
	05  ENAME	PIC X(10).
	05  FILLER      PIC X.
	05  DEPTID 	PIC X(05).
	05  FILLER	PIC X.	
	05  ELOC 	PIC X(26).
	05  FILLER 	PIC X.
	05  EPROJ 	PIC X(05). 


*

READ FILENAME INVALID KEY <STMTS>
	NOT INVALID KEY <STMTS>

(FOLLOWED BY)
READ FILENAME NEXT RECORD AT END <STMTS>


*

START FILENAME KEY IS <PRIMARYKEY>  
	INVALID KEY <STMTS>
	NOT INVALID KEY <STMTS>


*

WRITE EMP-REC INVALID KEY DISPLAY 'ERROR'
REWRITE EMP-REC INVALID KEY DISPLAY 'ERROR'
DELETE <FILENAME> RECORD INVALID KEY DISPLAY 'ERROR'