IDENTIFICATION DIVISION.
PROGRAM-ID. TRN1698B.

ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NUM1    PIC 9
01 WS-NUM2    PIC 99  VALUE 10.
01 WS-NUM3    PIC 99  VALUE 25.

PROCEDURE DIVISION.
1000-MAIN-PARA.
	DISPLAY 'INSIDE MAIN PARA'
	MOVE 1 TO WS-NUM1
	PERFORM 2000-FIRST-PARA UNTIL WS-NUM1 = 1
	STOP RUN.

2000-FIRST-PATA
	DISPLAY 'INSIDE PARA 1'
	MOVE 1 TO WS-NUM1.