IDENTIFICATION DIVISION.
PROGRAM-ID. SAMPLE.
ENVIRONMENT DIVISION.
DATA DIVISION.
01 WS-1    PIC 99


PROCEDURE DIVISION.
1000-MAIN-PARA.
	PERFORM 2000-INIT-PARA.
 	PERFORM 3000-MOVE-PARA.
	PERFORM 4000-CALC-PARA.
	PERFORM 5000-CLOSE-PARA.

	STOP RUN