WORKING-STORAGE SECTION
01 ALHPA VALUE = 'ABCDEFGHIJKLMNOPQRSTUVWXYZ'.
	05 LTR-TBL PIC X OCCURS 26 TIMES INDEXED BY IDX
01 SRCH-LTR PIC X CALUE 'J'.

PROCEDURE DIVISION.
	
	SET IDX TO 1.
	SEARCH LTR-TBL
		AT END DISPLAY 'LETTER NO FOUND'
		WHEN SRCH-LTR = LTR-TBL(IDX)
			DISPLAY 'RECORD FOUND'
		END-SEARCH.




WORKING-STORAGE SECTION
01 STUD-REC.
	05 STUD-TBL OCCURS 5 TIMES
		ASCENDING KEY IS ROLL-NO
		INDEXED BY IDX
		10 ROLLNO  PIC X(05)
		10 NAME1   PIC X(10)
		10 DEPT    PIC X(03)
01 STUD-FIND               PIC X(05) Á'1001'

PROCEDURE DIVISION.
	
	SET IDX TO 1.
	SEARCH ALL STUD-TB
		WHEN ROLLNO(IDX)=STUD-FIND
			DISPLAY 'RECORD FOUND'
		END-SEARCH.